.text
##########################################
li $v0,5
syscall   
add $s0,$v0,$0        #$s0------n
##########################################
addi $t9,$0,0         #$t9-----t=0
add $t7,$sp,$0        #$t7-----字符串首地址
##########################################
build:
beq $t9,$s0,prejudge
li $v0,12
syscall
sw $v0,0($sp)
subi $sp,$sp,4
addi $t9,$t9,1
j build
##########################################
prejudge:
add $t8,$sp,$0
addi $t8,$t8,4        #$t8------字符串最后一个的地址
##########################################
judge:
ble $t7,$t8,yes
lw $t5,0($t7)
lw $t6,0($t8)
bne $t5,$t6,no
subi $t7,$t7,4
addi $t8,$t8,4
j judge
##########################################
no:
la $a0,'0'
li $v0,11
syscall
li $v0,10
syscall
############################################
yes:
la $a0,'1'
li $v0,11
syscall
li $v0,10
syscall
